In [1]:
import pymysql

In [2]:
db = pymysql.connect(host = "localhost", # 서버주소를 입력한다. (우리는 컴퓨터에서 진행하므로 localhost로 진행)
                     user = "root",      # 사용자 이름을 입력
                     passwd = "sojung",    # 사용자 비밀번호를 입력
                     db = "sqlbook",      # 사용하려는 DB명을 입력
                     charset = "utf8"    # 따로 인코딩 설정을 하지 않으면 한글이 꺠진다! (???로 읽힘; euc-kr, cp949도 가능)
                    )

In [3]:
cursor = db.cursor()
cursor.execute("SELECT VERSION()")
data = cursor.fetchone()
print ("Database version : %s " % data)

Database version : 5.7.22-log

In [5]:
line = cursor.execute("SELECT * from perf")

In [6]:
for i in range(line):
    row = cursor.fetchone()
    print(row)

('23472', '이상희', datetime.date(1978, 2, 27), Decimal('117'), Decimal('2237065'), Decimal('23'))
('27896', '모영길', datetime.date(1982, 5, 11), Decimal('37'), Decimal('123721'), Decimal('2'))
('35478', '강주혁', datetime.date(1983, 9, 10), Decimal('86'), Decimal('830000'), Decimal('30'))
('56456', '모형건', datetime.date(1982, 1, 24), Decimal('123'), Decimal('3700000'), Decimal('24'))
('65412', '이상훈', datetime.date(1984, 5, 10), Decimal('23'), Decimal('467200'), Decimal('14'))
('78693', '이선우', datetime.date(1977, 7, 7), Decimal('103'), Decimal('1789023'), Decimal('7'))

In [11]:
data = cursor.fetchall()
print(data)

(('23472', '이상희', datetime.date(1978, 2, 27), Decimal('117'), Decimal('2237065'), Decimal('23')), ('27896', '모영길', datetime.date(1982, 5, 11), Decimal('37'), Decimal('123721'), Decimal('2')), ('35478', '강주혁', datetime.date(1983, 9, 10), Decimal('86'), Decimal('830000'), Decimal('30')), ('56456', '모형건', datetime.date(1982, 1, 24), Decimal('123'), Decimal('3700000'), Decimal('24')), ('65412', '이상훈', datetime.date(1984, 5, 10), Decimal('23'), Decimal('467200'), Decimal('14')), ('78693', '이선우', datetime.date(1977, 7, 7), Decimal('103'), Decimal('1789023'), Decimal('7')))

### 김대리의 실습 - 2 단원

In [41]:
import pandas as pd
from sqlalchemy import create_engine

pymysql.install_as_MySQLdb()
import MySQLdb 

#python3은 mysqldb를 지원하지 않기 때문에 pymysql로 불러와야한다.
#install_as_MySQLdb() 함수를 통해 MySQLdb와 호환 가능하다.

In [104]:
engine = create_engine('mysql://root:sojung@localhost/sqlbook?charset=utf8')

In [67]:
conn = engine.connect()
df = pd.read_sql_query('SELECT * FROM perf', conn)
df.head()

c:\users\lg\anaconda3\lib\site-packages\pymysql\cursors.py:165: Warning: (1366, "Incorrect string value: '\\xB4\\xEB\\xC7\\xD1\\xB9\\xCE...' for column 'VARIABLE_VALUE' at row 484")
  result = self._query(query)

  CUST_ID CUST_NM  CUST_BIRTH  VISIT_CNT  SALES_AMT  SALES_CNT
0   23472     이상희  1978-02-27      117.0  2237065.0       23.0
1   27896     모영길  1982-05-11       37.0   123721.0        2.0
2   35478     강주혁  1983-09-10       86.0   830000.0       30.0
3   56456     모형건  1982-01-24      123.0  3700000.0       24.0
4   65412     이상훈  1984-05-10       23.0   467200.0       14.0

In [ ]:
df = pd.read_sql_query( ,conn)
df.head()

In [43]:
#1번 
df = pd.read_sql_query('SELECT cust_id, cust_birth, visit_cnt FROM perf ORDER BY cust_birth',conn)
df.head()

  cust_id  cust_birth  visit_cnt
0   78693  1977-07-07      103.0
1   23472  1978-02-27      117.0
2   56456  1982-01-24      123.0
3   27896  1982-05-11       37.0
4   35478  1983-09-10       86.0

연령이 높을수록 방문 횟수가 많다.

In [68]:
#2번
df = pd.read_sql_query('SELECT cust_id, (sales_amt/visit_cnt) as sales_p_visit FROM perf ORDER BY sales_p_visit DESC',conn)
df.head()

  cust_id  sales_p_visit
0   56456     30081.3008
1   65412     20313.0435
2   23472     19120.2137
3   78693     17369.1553
4   35478      9651.1628

In [49]:
#2번
df = pd.read_sql_query('SELECT cust_id, sales_amt,visit_cnt FROM perf ORDER BY visit_cnt DESC',conn)
df.head()

  cust_id  sales_amt  visit_cnt
0   56456  3700000.0      123.0
1   23472  2237065.0      117.0
2   78693  1789023.0      103.0
3   35478   830000.0       86.0
4   27896   123721.0       37.0

자주 방문할수록 구입금액이 높으므로 방문하도록 유도하는 마케팅을 해야한다.

### 3단원

In [76]:
conn = engine.connect()
df = pd.read_sql_query('SELECT * FROM emp',conn)
df.head()

    ID POSITION PARTY_NM MANAGER_ID TEAM_NM GRADE
0  210       차장      문보미       3914     인사팀     3
1  345       대리      오윤경       1270    마케팅부     2
2  347       차장      정호천       3942     기획팀     3
3  540       과장      장성수       3221    리스크부     2
4  650       대리      이재훈       1270    마케팅부     1

In [82]:
#1번
df = pd.read_sql_query('SELECT count(distinct manager_id) as manager_n from emp' ,conn)
df.head()

   manager_n
0          4

기존 EMP 테이블에 문제가 있어 drop table emp를 실행했으나 멈추는 현상이 발생했다.

> show processlist
> kill [id 이름]

으로 'sleep'상태인 active processes를 끝낸다.-해-결

### 4단원

In [105]:
conn = engine.connect()
df = pd.read_sql_query('SELECT * FROM CARD_TRAN_201311',conn)
df.head()

c:\users\lg\anaconda3\lib\site-packages\pymysql\cursors.py:165: Warning: (1366, "Incorrect string value: '\\xB4\\xEB\\xC7\\xD1\\xB9\\xCE...' for column 'VARIABLE_VALUE' at row 484")
  result = self._query(query)

    CMF PARTY_NM   SEG    PIF_AMT   INST_AMT   OVRS_AMT  CASH_AMT
0  1746      임하영    PB  7836100.0  3213400.0        NaN       NaN
1  2356      김아름    PB  1234041.0        NaN  1301710.0       NaN
2  3120      김지철    PB        NaN        NaN        NaN       NaN
3  3255      김지연  MASS      213.0        NaN        NaN       NaN
4  3266      윤일상  MASS    89641.0        NaN        NaN       NaN

In [102]:
#1번
df = pd.read_sql_query('select cmf, party_nm, (coalesce(pif_amt,0) + coalesce(inst_amt,0) + coalesce(ovrs_amt,0) + coalesce(cash_amt,0)) as total from card_tran_201311 order by total desc',conn)
df.head()
#null을 사칙연산하면 null 값이다.

    cmf party_nm       total
0  1746      임하영  11049500.0
1  4678      최혜연   4567780.0
2  4563      홍지은   3913570.0
3  2356      김아름   2535751.0
4  8904      이동건   1778960.0

In [106]:
#2번
df = pd.read_sql_query('select cmf,party_nm,inst_amt from card_tran_201311 where inst_amt is not NULL',conn)
df.head()

    cmf party_nm   inst_amt
0  1746      임하영  3213400.0
1  8904      이동건   500000.0

In [119]:
#3번
df = pd.read_sql_query('select cmf, party_nm, pif_amt*0.1 as return_amt from card_tran_201311',conn)
df.head()

    cmf party_nm  return_amt
0  1746      임하영    783610.0
1  2356      김아름    123404.1
2  3120      김지철         NaN
3  3255      김지연        21.3
4  3266      윤일상      8964.1

### 5장

In [126]:
#1번
conn = engine.connect()
df = pd.read_sql_query('select cmf,party_nm from perf_mast_201312 where coalesce(tot_amt_1,0) <= 10000 and coalesce(tot_amt_2,0)<=10000 and coalesce(tot_amt_3,0)<=10000',conn)
df

    cmf party_nm
0  2356      김아름
1  3120      김지철
2  4563      홍지은
3  4678      최혜연
4  8974      강성범

In [128]:
#2번
conn = engine.connect()
df = pd.read_sql_query('select cmf,party_nm from perf_mast_201312 where tot_amt_1 <= 10000 and tot_amt_2 <= 10000 and tot_amt_3 <= 10000',conn)
df

    cmf party_nm
0  2356      김아름